Tekla Open API Reference for Tekla Structures 2025
Point.Translate Method
 Translates the point using the given vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public virtual void Translate(
	double X,
	double Y,
	double Z
)
Public Overridable Sub Translate (
	X As Double,
	Y As Double,
	Z As Double
)
Parameters
X
Type: System.Double
The X-translation to be used.
Y
Type: System.Double
The Y-translation to be used.
Z
Type: System.Double
The Z-translation to be used.
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace